step-by-step/030-populate-database/040-soap/0200-платежи/0100.xml

<?xml version="1.0" ?>
<!-- Договор -> Открыть договор -> ДОГОВОР -> Баланс -> Приход -->
<!-- Создаем платеж -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:paymentUpdate xmlns:common="http://common.bitel.ru"
                           xmlns:ns5="http://common.balance.contract.kernel.bgbilling.bitel.ru/"
                           xmlns:xs="http://www.w3.org/2001/XMLSchema"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <payment xmlns="" contractId="1" date="2016-12-06T00:00:00+03:00" id="-1" sum="100.0" summa="100.0"
                     typeId="1" userId="0">
                <comment></comment>
            </payment>
        </ns5:paymentUpdate>
    </S:Body>
</S:Envelope>
